

{
"ne": "&lt;p style=&quot;text-align:center&quot;&gt;&lt;img alt=&quot;nepal flag&quot; src=&quot;https://raw.githubusercontent.com/rgtstha/NEPAL-QUEST-DATA/main/images/nepal_flag.png&quot; style=&quot;height:200px; width:164px&quot; /&gt;&lt;/p&gt;&lt;p style=&quot;text-align:center&quot;&gt;&lt;strong&gt;नेपालको राष्ट्रिय झण्डा बनाउने बिधि&lt;/strong&gt;&lt;/p&gt;&lt;p style=&quot;text-align:center&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;u&gt;&lt;strong&gt;स्पष्टीकरण &lt;/strong&gt;&lt;/u&gt;: झण्डा बनाउँदा खिचिएका ज, झ, द, ध, च, ङ, ङ घ, ञ छ, ण थ, ञ, ट, र प, फ रेखाहरू कल्पित हुन्। त्यस्तै सूर्यका बाहिरी र भित्री वृत्ताकारहरू तथा खुर्पे चन्द्र बाहेक अरु वृत्त खण्ड पनि कल्पित हुन्। यिनलाई झण्डामा देखाइँदैन ।&lt;/p&gt;&lt;p&gt;&lt;u&gt;&lt;strong&gt;द्रष्टव्य:&lt;/strong&gt;&lt;/u&gt; राष्ट्रिय झण्डाको आकार नेपाल सरकारले निर्धारण गरे बमोजिम हुनेछ ।&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;span style=&quot;font-size:20px&quot;&gt;&lt;u&gt;&lt;strong&gt;किनारा भित्रको आकार बनाउने तरिका&lt;/strong&gt;&lt;/u&gt;&lt;/span&gt;&lt;ul&gt;&lt;li&gt;(१) एउटा सिम्रिक रंगको रातो कपडामा तल्लो भागमा चाहिएको जति लम्बाईको रेखा बायाँबाट दाहिने तिर खिच्ने र यसलाई क ख नाम राख्ने |&lt;/li&gt;&lt;li&gt;(२) क बाट सीधा माथि ग सम्म क ख को लम्बाइ जतिमा क ख कै तृतीयांश थप्दा जति हुन्छ त्यति लामो हुने गरी क ग रेखा खिच्ने । क ग मा क बाट क ख को लम्बाइ जति लिई घ चिनो लगाउने। ख र घ जोड्ने ।&lt;/li&gt;&lt;li&gt;(३) ख घ रेखामा ख बाट क ख जति लिई ङ चिनो लाउने ।&lt;/li&gt;&lt;li&gt;(४) ङ हुँदै क ख को समानान्तर पारेर क ग मा पर्ने बिन्दु च बाट शुरु गरी दाहिनेतिर छ सम्म क ख को लम्बाइ जति रेखा खिच्ने।&lt;/li&gt;&lt;li&gt;(५) ग र छ लाई जोड्ने ।&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:20px&quot;&gt;&lt;u&gt;&lt;strong&gt;चन्द्र बनाउने तरीका&lt;/strong&gt;&lt;/u&gt;&lt;/span&gt;&lt;ul&gt;&lt;li&gt;(६) क ख को चतुर्थांश जति क बाट दाहिनेमा ज चिनो लाउने र त्यहाँबाट माथि क ग को समानान्तर पारेर ग छ लाई झ मा छुने रेखा खिच्ने।&lt;/li&gt;&lt;li&gt;७) ग च को आधा ञ बाट क ख को समानान्तर पारेर रेखा दायाँतिर खिची ग छ लाई ट मा छुने ।&lt;/li&gt;&lt;li&gt;(८) ञ ट र ज झ रेखा काटिएको ठाउँमा ठ चिनो राख्ने ।&lt;/li&gt;&lt;li&gt;(९) ञ र छ जोड्ने ।&lt;/li&gt;&lt;li&gt;(१०) ञ छ र ज झ काटिएको बिन्दुमा ड चिनो लाउने ।&lt;/li&gt;&lt;li&gt;(११) ड लाई केन्द्र मानी ख घ रेखालाई न्यूनतम अन्तर पर्ने गरी स्पर्श गर्दा हुने जति दूरी पर्ने गरी ज झ रेखाको तल्लो भागमा ढ चिनो लगाउने ।&lt;/li&gt;&lt;li&gt;(१२) ड मा छोई क ख को समानान्तर रेखा बायाँबाट दायाँतिर खिच्ने र यसले क ग लाई छोएको बिन्दुको नाम ण राख्ने ।&lt;/li&gt;&lt;li&gt;(१३) ठ केन्द्र लिएर ठ ढ व्यासाद्र्धले तल्लो भागमा वृत्त खण्ड खिच्ने र ण ड बाट गएको रेखालाई यसले छोएको दुवै ठाउँमा क्रमशः त र थ नाम राख्ने ।&lt;/li&gt;&lt;li&gt;(१४) ड लाई केन्द्र मानी ड थ व्यासाद्र्धले तल्लो भागमा अर्ध वृत्ताकार त थ लाई छुने गरी खिच्ने ।&lt;/li&gt;&lt;li&gt;(१५) ढ केन्द्र मानी ढ ड को व्यासाद्र्धले त ढ थ वृत्त खण्डको दुवैतर्फ छुने गरी वृत्त खण्ड खिच्ने र यसले त ढ थ लाई छोएको विन्दुहरूको नाम क्रमशः द र ध राख्ने । द ध लाई जोड्ने । द ढ र ज झ काटिएको विन्दुको नाम न राख्ने ।&lt;/li&gt;&lt;li&gt;(१६) न लाई केन्द्र मानेर व्यासाद्र्ध न ध ले त ढ थ को माथिल्लो भागमा दुवै ठाउँमा छुने गरी अर्ध वृत्ताकार खिच्ने ।&lt;/li&gt;&lt;li&gt;(१७) न लाई केन्द्र मानेर व्यासाद्र्ध न ड ले त ढ थ को माथिल्लो भागमा दुवै ठाउँमा छुने गरी वृत्त खण्ड खिच्ने ।&lt;/li&gt;&lt;li&gt;(१८) यस अनुसूचीको नं. (१६) को अर्ध वृत्ताकार भित्र र नं. (१७) को वृत्त खण्ड बाहिर चन्द्रमाको आठवटा बराबरका कोण बनाउने ।&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:20px&quot;&gt;&lt;u&gt;&lt;strong&gt;सूर्य बनाउने तरीका&lt;/strong&gt;&lt;/u&gt;&lt;/span&gt;&lt;ul&gt;&lt;li&gt;(१९) क च को आधा प बाट क ख को समानान्तर पारेर ख ङ मा छुने गरी प फ रेखा खिच्ने ।&lt;/li&gt;&lt;li&gt;(२०) ज झ र प फ काटिएको विन्दु ब केन्द्र मानेर ड ढ को व्यासाद्र्धले वृत्ताकार पूरा खिच्ने ।&lt;/li&gt;&lt;li&gt;(२१) ब लाई केन्द्र मानेर ठ ढ व्यासाद्र्धले वृत्ताकार पूरा खिच्ने ।&lt;/li&gt;&lt;li&gt;(२२) यो अनुसूचीको नं. (२०) को वृत्ताकार बाहिर र यो अनुसूचीको नं. (२१) को वृत्ताकारभित्र परेको गोल घेराको बीच भागमा सूर्यको बाह्रवटा बराबरका कोणहरू दुई चुच्चाहरूले ज झ रेखामा छुने गरी बनाउने ।&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:20px&quot;&gt;&lt;u&gt;&lt;strong&gt;किनारा बनाउने तरीका&lt;/strong&gt;&lt;/u&gt;&lt;/span&gt;&lt;ul&gt;&lt;li&gt;(२३) न ढ को चौडाइ जति गाढा नीलो रंगको किनारा झण्डाको आकारको बाहिरी सबैतिरको सीमामा थप्ने, तर झण्डाको पाँच कोणहरूमा चाहिं बाहिरी कोणहरू पनि भित्रै सरहका बनाउने ।&lt;/li&gt;&lt;li&gt;(२४) झण्डा डोरी लगाई प्रयोग गरेमा माथि बताइएकै पट्टी राख्ने । झण्डा लट्ठीमा घुसार्ने हो भने क ग पट्टि आवश्यक परे जति किनारा चौड्याउने । डोरी वा लट्ठीको प्रयोगमा क ग को पट्टीमा प्वाल राख्ने ।&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;/ul&gt;",
"en": "&lt;p style=&quot;text-align:center&quot;&gt;&lt;img alt=&quot;nepal flag&quot; src=&quot;https://raw.githubusercontent.com/rgtstha/NEPAL-QUEST-DATA/main/images/nepal_flag.png&quot; style=&quot;height:200px; width:164px&quot; /&gt;&lt;/p&gt;&lt;p style=&quot;text-align:center&quot;&gt;&lt;strong&gt;The method to make the national flag of Nepal.&lt;/strong&gt;&lt;/p&gt;&lt;p style=&quot;text-align:center&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;u&gt;&lt;strong&gt;Explanation&lt;/strong&gt;&lt;/u&gt;: The lines HI, RS, FE, ED, JG, OQ, JK, and UV are imaginary. Similarly, the external and internal circles of the sun and the other arcs except the crescent moon are also imaginary. These are not shown on the flag&lt;/p&gt;&lt;p&gt;&lt;u&gt;&lt;strong&gt;Note:&lt;/strong&gt;&lt;/u&gt; The size of the National Flag of Nepal shall be as determined by the Government of Nepal.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;span style=&quot;font-size:20px&quot;&gt;&lt;u&gt;&lt;strong&gt;Method of making the shape inside the borderा&lt;/strong&gt;&lt;/u&gt;&lt;/span&gt;&lt;ul&gt;&lt;li&gt;(1)On the lower portion of a crimson cloth draw a line AB of the required length from left to right.&lt;/li&gt;&lt;li&gt;(2) From A draw a line AC perpendicular to AB making AC equal to AB plus one-third AB. From AC mark off D making line AD equal to line AB. Join B and D.&lt;/li&gt;&lt;li&gt;(3) From BD mark off E making BE equal to AB.&lt;/li&gt;&lt;li&gt;(4) Touching E draw a line FG, starting from point F on line AC, and parallel to AB to the right-hand side. Mark off FG equal to AB.&lt;/li&gt;&lt;li&gt;(5) Join C and G&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:20px&quot;&gt;&lt;u&gt;&lt;strong&gt;Method of making the moon&lt;/strong&gt;&lt;/u&gt;&lt;/span&gt;&lt;ul&gt;&lt;li&gt;(6) From AB mark off AH making AH equal to one-fourth of line AB and starting from H draw a line HI parallel to line AC touching line CG at the point I.&lt;/li&gt;&lt;li&gt;(7) Bisect CF at J and draw a line JK parallel to AB touching CG at point K.&lt;/li&gt;&lt;li&gt;(8) Let L be the point where lines JK and HI cut one another.&lt;/li&gt;&lt;li&gt;(9) Join J and G.&lt;/li&gt;&lt;li&gt;(10) Let M be the point where line JG and HI cut one another.&lt;/li&gt;&lt;li&gt;(11) With centre M and with a distance shortest from M to BD mark off N on the lower portion of line HI.&lt;/li&gt;&lt;li&gt;(12) Touching M and starting from O, a point on AC, draw a line from left to right parallel to AB.&lt;/li&gt;&lt;li&gt;(13) With centre L and radius LN draw a semi-circle on the lower portion and let P and Q be the points where it touches the line OM respectively.&lt;/li&gt;&lt;li&gt;(14) With centre M and radius MQ draw a semi-circle on the lower portion touching P and Q.&lt;/li&gt;&lt;li&gt;(15) With centre N and radius NM draw an arc touching PNQ at R and S. Join RS. Let T be the point where RS and HI cut one another.&lt;/li&gt;&lt;li&gt;(16) With centre T and radius TS draw a semi-circle on the upper portion of PNQ touching it at two points.&lt;/li&gt;&lt;li&gt;(17) With centre T and radius TM draw an arc on the upper portion of PNQ touching at two points.&lt;/li&gt;&lt;li&gt;(18) Eight equal and similar triangles of the moon are to be made in the space lying inside the semi-circle of No. (16) and outside the arc of No. (17) of this Schedule.&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:20px&quot;&gt;&lt;u&gt;&lt;strong&gt;Method of making the sun&lt;/strong&gt;&lt;/u&gt;&lt;/span&gt;&lt;ul&gt;&lt;li&gt;(19) Bisect line AF at U, and draw a line UV parallel to the AB line touching line BE at V.&lt;/li&gt;&lt;li&gt;(20) With centre W, the point where HI and UV cut one another and radius MN draws a circle.&lt;/li&gt;&lt;li&gt;(21) With centre W and radius LN draw a circle.&lt;/li&gt;&lt;li&gt;(22) Twelve equal and similar triangles of the sun are to be made in the space enclosed by the circles of No. (20) and of No. (21) with the two apexes of two triangles touching line HI.&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:20px&quot;&gt;&lt;u&gt;&lt;strong&gt;Method of making the borderा&lt;/strong&gt;&lt;/u&gt;&lt;/span&gt;&lt;ul&gt;&lt;li&gt;(23) The width of the border will be equal to the width of TN. This will be of deep blue colour and will be provided on all the sides of the flag. However, on the five angles of the flag, the external angles will be equal to the internal angles.&lt;/li&gt;&lt;li&gt;(24) The above-mentioned border will be provided in case the flag is to be used with a rope. On the other hand, in case it is to be hoisted on a pole, the hole on the border on the side AC can be extended in accordance with requirements.&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;/ul&gt;"
}